
def main():
    '''
       print() 함수를 사용하여 다음과 같이 출력하라

       출력:
            sk;kakao;naver;samsung
    '''
    m="sk"
    m2="kakao"
    m3="naver"
    m4="samsung"

    print("-------------------------------------------------------------------------------")
    ####### 구현 시작 ################

    print(m, end=";")
    print(m2, end=";")
    print(m3, end=";")
    print(m4)
    print(m, m2, m3, m4, sep=";")

    ########구현 끝 #######################
    print("-------------------------------------------------------------------------------")


# # 메인 함수 호출 ##
if __name__ == "__main__":
    main()
