
def main():
    '''
       사용자로 입력받은 단어가 아래 fruit 리스트에 포함되어 있는지를 확인하라.
       포함되었다면 "정답입니다"를 아닐 경우 "오답입니다" 출력하라.
    '''

    fruit = ["사과", "포도", "홍시"]
    mesg = None
    user_in = input("좋아하는과일은?")

    ####### 구현 시작 ################
    if user_in in fruit:
        mesg = "정답입니다"
    else:
        mesg = "오답입니다"

    ########구현 끝 #######################


    print("-------------------------------------------------------------------------------")
    print(mesg)
    print("-------------------------------------------------------------------------------")


# # 메인 함수 호출 ##
if __name__ == "__main__":
    main()
