
def main():
    '''
     입력된 문자열을 꺼꾸로 출력하는 코드를 작성하시오.

    입력: rise to vote sir
    출력: ris etov ot esir

    '''
    m = "rise to vote sir"
    reverse_m = None

    ####### 구현 시작 ################

    reverse_m = m[::-1]

    ########구현 끝 #######################
    
    print("-------------------------------------------------------------------------------")
    print(reverse_m)
    print("-------------------------------------------------------------------------------")


# # 메인 함수 호출 ##
if __name__ == "__main__":
    main()
