
def main():
    '''
     아래의 전화번호에서 하이푼 ('-')을 제거하고 출력하라.

    phone_number = "010-1111-2222"

    출력:
        010 1111 2222

    '''
    phone_number = "010-1111-2222"

    new_number_phone = None
    ####### 구현 시작 ################

    new_number_phone = phone_number.replace("-", " ")

    ########구현 끝 #######################

    print("-------------------------------------------------------------------------------")
    print(new_number_phone)
    print("-------------------------------------------------------------------------------")


# # 메인 함수 호출 ##
if __name__ == "__main__":
    main()
